/*
 	1. 주석 
 		1. 한줄주석 : //
 		2. 여러줄 주석 :  
 	2. 출력 함수
 		1. console.log ('하고싶은말') : F12개발자도구 console탬 출력되는 함수 [*]
 		2. alert('하고싶은말') 	      :  알람 메시지 [확인] 출력하는 함수
 		3. confirm('하고싶은말')     : ㅊ
 		
 	3.데이터 자료형(형식)
 		1. 문자 : ' ' 혹은 " "
 		2. 숫자 : 200
 		3. 논리 : true 혹은 false 
 */

 // 1. 출력
 console.log('안녕 Js')	// 1.문자 입력시 ' ' 사용 
 console.log("안녕 js") // 2.문자 입력시 " " 사용
 console.log( 200 )	// 3.숫자는 문자처리 x
 console.log("200")	// 4. "숫자"는 문자형식
 console.log(true)		// 5. 논리형
 console.log(20+"개")	// 6. '문자'+숫자 = 문자 (+ : 연결연산자) 
 
 // 2. 출력
alert('안녕 Js')
alert(20+20)	// 7. 숫자 + 숫자 => 숫자 (+ : 연결연산자) 40출력
alert("20+20") //2020 출력
 
 // 3. 출력
confirm('컨펌 Js') 
 
// 4. 입력 + 출력
prompt('입력 Js') 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 