package 과제1; 

public class 과제1 {

	/* 
	  	1. (2인1조) 연산자 암기 확인
	  	
	  	2. (1인)p.73 ~ p.76 풀이 => 카톡방 과제1 git 주소 
	  	
	  		// p.73
	  		// 문제1 답 : 3
	  		// 문제2 	답 : 2,3,6,7
	  		 * 				    1               2          4      8   
	  		// 문제3 답: 정수타입: (byte)	(short),(char)  (int)   (long) 
	  		 		   실수타입: 							(float) (double) 
	  		 		   논리타입: (boolean) 
	  		// 문제4 답: 타입: (int) , (double)
	  		 		변수이름: (age) , (price) 
	  		 		리터럴: (10),(3.14) 
	  		// 문제5 답: 3
	  		// 문제6 답: 4
	  		 * 객체는 기본타입이므로 캐스팅불가
	  		// 문제7 답: 3
	  		// 문제8 답: 3
	  		// 문제9 답: 1
	  		// 문제10 답: 2 
	  		// 문제11 답: 13 , 16
	 */
	
}
